cf/Catalogs/Новинки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Новинки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНовинок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Готовность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Готовность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>idстроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Идентификатор</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Catalogs/Новинки/Forms/ПодборНовинок/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЕстьСклад = ЗначениеЗаполнено(Склад);
	ЕстьПроизводитель = Производитель.Количество();
	
	Новинки.Очистить();
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Тов1.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&Период, &КонецПериода, , ,"+?(ЕстьСклад,"Склад = &Склад","") + 
																					   ?(ЕстьСклад И ЕстьПроизводитель," И ","") + 
																					   ?(ЕстьПроизводитель," Номенклатура.Производитель В (&Производитель) ","")+") КАК Тов1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(, &Период, , ,"+?(ЕстьПроизводитель," Номенклатура.Производитель В (&Производитель) ","")+" ) КАК Тов2
	|		ПО Тов1.Номенклатура = Тов2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НовинкиТовары.Номенклатура КАК Номенклатура
	|		ИЗ
	|			Справочник.Новинки.Товары КАК НовинкиТовары
	|		ГДЕ
	|			НовинкиТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК Новинки
	|		ПО Тов1.Номенклатура = Новинки.Номенклатура
	|ГДЕ
	|	Тов1.КоличествоНачальныйОстаток = 0
	|	И Тов1.КоличествоПриход > 0
	|	И Тов2.КоличествоПриход ЕСТЬ NULL 
	|	И Новинки.Номенклатура ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("Период",Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Производитель",Производитель);
	
	
	Запрос.УстановитьПараметр("Склад",Склад);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(Новинки,Выборка);

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Если нЕ ЗначениеЗаполнено(Период) Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ПолучитьАдресВременногоХранилищаТаблицы());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВременногоХранилищаТаблицы()
	
	Возврат ПоместитьВоВременноеХранилище(Новинки.Выгрузить(),УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура Очистить()
	ЭтотОбъект.Новинки.Очистить();
КонецПроцедуры
